app/controllers/administration_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 7) LIMIT 1
---
  def view_users
    @users = User.find(:all)

INSERT INTO "users" ("created_at", "company_name", "updated_at", "username", "hashed_password", "role", "last_name", "first_name", "email") VALUES('2008-11-27 22:02:14', 'Student', '2008-11-27 22:02:14', 'Jay', 'ac5386921bd55098ee8d1775945dd8702867cf49', 'Admin', 'Mundrawala', 'Jay', 'jmundraw@iit.edu')
---
  def create_user
    params[:user]["username"].downcase!
    params[:user]["username"].strip
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def delete_project
    @project = Project.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = '--- :user_id
---
  def edit_user
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = -611480088)
UPDATE "users" SET "updated_at" = '2008-11-27 01:50:42', "company_name" = 'studente' WHERE "id" = 1
---
  def update_user
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "users" WHERE "id" = 1
---
  def delete_user
    @user = User.find(params[:id])
    @user.destroy