app/controllers/project_management_controller.rb

  def manage

    @project = Project.find_by_id(params[:id])
---
SELECT * FROM "projects" WHERE ("projects"."id" IS NULL) LIMIT 1

  def new_test_plan
    p = Requirement.find(params[:rid]).project
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT * FROM "requirements" WHERE ("requirements"."id" = 13)

  def add_test_plan
    p = Requirement.find(params[:rid]).project
    if (in_project?(p) == false ||
        (@current_user.role != 'Manager' && @current_user.role != 'Developer'))
      flash[:warning] = 'You are not authorized to perform this action'
      redirect_to :action => 'manage', :id => p
      return
    end
    r = Requirement.find params[:rid]
    @test_plan = TestPlan.new params[:test_plan]

    if r.test_plans << @test_plan
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT * FROM "requirements" WHERE ("requirements"."id" = 11)
INSERT INTO "test_plans" ("created_at", "updated_at", "requirement_id", "description") VALUES('2008-12-07 17:17:27', '2008-12-07 17:17:27', 11, 'This is a test Test plan')

  def delete_test_plan
    plan = TestPlan.find params[:tid]
    r = plan.requirement
    p = r.project
    if (in_project?(p) == false ||
        (@current_user.role != 'Manager' && @current_user.role != 'Developer'))
      flash[:warning] = 'You are not authorized to perform this action'
      redirect_to :action => 'manage', :id => p
      return
    end
    plan.destroy
---
SELECT * FROM "test_plans" WHERE ("test_plans"."id" = 2)
DELETE FROM "test_plans" WHERE "id" = 2

  def new_requirement
    p = Project.find params[:pid]
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)

  def add_requirement
    p = Project.find params[:pid]
    if(in_project?(p) == false || (@current_user.role != 'Manager' &&
       @current_user.role != 'Developer'))
      flash[:warning] = 'You are not authorized to perform this action'
      redirect_to :action => 'manage', :id => p
      return
    end
    u = @current_user

    @requirement = Requirement.new params[:requirement]

    if p.requirements << @requirement == false
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
INSERT INTO "requirements" ("name", "created_at", "project_id", "updated_at", "description", "status") VALUES('sadf', '2008-12-07 05:41:19', 1, '2008-12-07 05:41:19', 'sadf', 'Accepted')

  def remove_requirement
    p = Project.find params[:pid]
    if(in_project?(p) == false || @current_user.role != 'Manager')
      flash[:warning] = 'You are not authorized to perform this action'
      redirect_to :action => 'manage', :id => p
      return
    end
    r = Requirement.find params[:rid]
    r.destroy
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT * FROM "requirements" WHERE ("requirements"."id" = '10') LIMIT 1
DELETE FROM "requirements" WHERE "id" = 10

  def new_feature
    p = Project.find params[:pid]
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)

  def add_feature
    p = Project.find params[:pid]
    if (in_project?(p) == false || (@current_user.role != 'Manager' &&
                                    @current_uesr.role != 'Customer'))
      flash[:warning] = 'You are not authorized to perform this action'
      redirect_to :action => 'index'
      return
    end
    u = @current_user

    @feature = Feature.new params[:feature]
    @feature.user = @current_user
    if p.features << @feature == false
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
INSERT INTO "features" ("name", "created_at", "updated_at", "rank", "user_id", "description", "risk") VALUES('New Feature', '2008-12-07 06:32:58', '2008-12-07 06:32:58', NULL, NULL, 'New Feature', NULL)

  def remove_feature
    f = Feature.find params[:fid]
    p = Project.find params[:pid]
    if(in_project?(p) == false || (@current_user.role != 'Manager' && @current_uesr.role != f.user))
      flash[:warning] = 'You are not authorized to perform this action'
      redirect_to :action => 'manage', :id => p
      return
    end
    fpr = f.feature_project_relationships.find_by_project_id p
    fpr.destroy
---
SELECT * FROM "features" WHERE ("features"."id" = 3)
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT "features".* FROM "features" INNER JOIN feature_project_relationships ON features.id = feature_project_relationships.feature_id WHERE (("feature_project_relationships".project_id = 1))
SELECT "users".* FROM "users" INNER JOIN user_project_relationships ON users.id = user_project_relationships.user_id WHERE (("user_project_relationships".project_id = 1))
SELECT * FROM "feature_project_relationships" WHERE ("feature_project_relationships"."project_id" = 1) AND ("feature_project_relationships".feature_id = 3) LIMIT 1
DELETE FROM "feature_project_relationships" WHERE "id" = 3

  def edit_requirement
    @requirement = Requirement.find params[:rid]
---
SELECT * FROM "requirements" WHERE ("requirements"."id" = 11)

  def update_requirement
    @requirement = Requirement.find(params[:rid])
    p = @requirement.project
    if (in_project?(p) == false || (
      @current_user.role != 'Manager' && @current_user.role != 'Developer'))
      flash[:warning] = 'You are not authorized to perform this action'
      redirect_to :action => 'index'
      return
    end
    flash[:notice] = flash[:warning] = nil

    if @requirement.update_attributes(params[:requirement])
---
SELECT * FROM "requirements" WHERE ("requirements"."id" = 11)
UPDATE "requirements" SET "updated_at" = '2008-12-09 23:13:31', "description" = 'Another test requirement. It was edited.' WHERE "id" = 16

  def add_user
    p = Project.find params[:pid]
    if(in_project?(p) == false || @current_user.role != 'Manager') then
      flash[:warning] = 'You are not authorized to perform this action'
      redirect_to :action => 'manage', :id => params[:pid]
      return
    end
    u = User.find params[:id]
    if p.users.find_index(u) == nil
---
SELECT * FROM "projects" WHERE ("projects"."id" IS NULL) LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 8) LIMIT 1
SELECT "users".* FROM "users" INNER JOIN user_project_relationships ON users.id = user_project_relationships.user_id WHERE (("user_project_relationships".project_id = 10))

  def delete_user

    p = Project.find params[:pid]

    if in_project?(p) == false || @current_user.role != 'Manager'
      flash[:warning] = 'You are not authorized to perform this action'
      redirect_to :action => 'index'
      return
    end

    u = User.find params[:id]
    i = p.users.find_index(u)
    if i == nil
      flash[:notice] = "User is not in this project"
    else
      upr = u.user_project_relationship.find_by_project_id p
      upr.destroy
---
SELECT * FROM "projects" WHERE ("projects"."id" = 10)
SELECT * FROM "users" WHERE ("users"."id" = 8) LIMIT 1
SELECT "users".* FROM "users" INNER JOIN user_project_relationships ON users.id = user_project_relationships.user_id WHERE (("user_project_relationships".project_id = 10))
SELECT * FROM "user_project_relationships" WHERE ("user_project_relationships"."project_id" = 10) AND ("user_project_relationships".user_id = 9) LIMIT 1
DELETE FROM "user_project_relationships" WHERE "id" = 17

  def create_project
    @project = Project.new(params[:project])
    @project.open_date = Time.now
    @project.users << @current_user
---
INSERT INTO "projects" ("name", "created_at", "close_date", "updated_at", "open_date", "description") VALUES('Project 4', '2008-11-28 17:11:39', NULL, '2008-11-28 17:11:39', '2008-11-27 15:46:06', 'This is a test for project 4. Project 4 should contain user ''manager''.')

  def crud_user

    @project = Project.find_by_id(params[:pid])
    unless params[:query].nil?
      @query = params[:query]
      condition = ["username LIKE ? OR first_name LIKE ? OR last_name LIKE ?",
      "#{params[:query]}","#{params[:query]}","#{params[:query]}"] unless params[:query].nil?
      @query = condition
      @users = User.find(:all, :conditions => condition)
---
SELECT * FROM "projects" WHERE ("projects"."id" IS NULL) LIMIT 1
SELECT * FROM "users" WHERE (username LIKE 'manager' OR first_name LIKE 'manager' OR last_name LIKE 'manager')

  def destroy
    @project = Project.find(params[:id])

    if (in_project?(@project) == false || @current_user.role != 'Manager')
      flash[:warning] = 'You are not authorized to perform this action'
      redirect_to :action => 'index'
      return
    end
    if @project.close_date
      @project.destroy
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
DELETE FROM "projects" WHERE "id" = 5

  def close_project
    @project = Project.find(params[:id])
    if(in_project?(@project) || @current_user.role != 'Manager')
      flash[:warning] = 'You are not authorized to perform this action'
      redirect_to :action => 'index'
      return
    end
    if @project.close_date = Time.now and @project.save
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
UPDATE "projects" SET "updated_at" = '2008-11-28 04:37:55', "close_date" = '2008-11-28 04:37:55' WHERE "id" = 1