app/controllers/project_management_controller.rb

SELECT "users".* FROM "users" INNER JOIN user_project_relationships ON users.id = user_project_relationships.user_id WHERE (("user_project_relationships".project_id = 1))
---
  def manage

    @project = Project.find_by_id(params[:id])

    if @project.users.find_index(@current_user) != nil